Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/older_and_retired_people/state_pension_contributory.html.txt.tmx
Source language: en
Languages: ga

source: This pro-rata pension was only payable to people who meet specific conditions
ga: Níor íocadh an pinsean pro-rata seo ach amháin le daoine a chomhlíonann na coinníollacha speisialta

source: That is, they had to have a broken insurance record and have re-entered insurance in 1974 because of the removal of the income limit
ga: Caithfidh siad taifead briste a bheith acu agus a tháinig isteach in árachas arís sa bhliain 1974 nuair a cuireadh deireadh leis an teorainn ioncaim

source: Their average is measured in the usual way and if that average is 10 or more they got a pension in the normal way
ga: Déantar an mheánuimhir a mheas ar an ngnáthbhealach agus má tá 10 nó breis acu ar an meán faigheann siad pinsean ar an ngnáthbhealach

source: However, if it was between 5 and 9 they got a special partial pension which was one quarter of the maximum pension
ga: Áfach, má tá sí idir 5 agus 9, fuair siad pinsean pro-rata, (ceathrú den uasphinsean)

source: See Further information below for more information on other pro-rata pensions that no longer apply to many people (because most people who would qualify are now over 66)
ga: Féach ‘Tuilleadh eolais’ chun faisnéis bhreise maidir le pinsin pro-rata eile nach baineann le go leor daoine (tá an chuid is mó den daoine incháilithe os cionn aois 66)

source: If you have worked in Ireland and one or more EU states your social insurance contributions from each EU state will be added to your Irish social insurance contributions to help you qualify for a social welfare payment
ga: Má d'oibrigh tú in Éirinn agus i mballstát nó i mballstáit de chuid an AE, cuirfear do chuid ranníocaíochtaí árachais shóisialta ó gach ballstát le do chuid ranníocaíochtaí árachais shóisialta in Éirinn le gur fearr do theideal ar íocaíocht leasa shóisialaigh

source: More information about combining your social insurance contributions to qualify for a state pension is available
ga: Tá tuilleadh eolais ar fáil faoi do chuid ranníocaíochtaí árachais shóisialta a chur le chéile le teideal a fháil ar phinsean stáit

source: Increases for a qualified adult and pensioners over 80 years of age are calculated in the same way as the personal rate of pension
ga: Oibrítear amach na liúntais le haghaidh daoine fásta agus le haghaidh daoine ós cionn 80 ar an mbealach seo freisin

source: Increases for a qualified child are payable from one country only and, if from Ireland, are paid in full
ga: Ní féidir an liúntas le haghaidh páiste cleithiúnaigh a fháil ach ó thír amháin agus más as Éirinn atá sé ag teacht íocfar ina iomláine é

source: Bilateral social security agreements
ga: Comhaontuithe déthaobhach leasa ahóisialaigh

source: Ireland has bilateral social security agreements with Canada, the USA, Australia, New Zealand, Austria, Japan, Republic of Korea and Quebec (which has a separate system from the rest of Canada)
ga: Tá comhaontuithe déthaobhach leasa shóisialaigh ag Éirinn le Ceanada, na Stáit Aontaithe, An Astráil, An Nua Shéalainn, An Eilbhéis, an Ostair, an tSeapáin, Korea, agus le Quebec (a bhfuil córas éagsúil aici ón gcuid eile de Cheanada)

source: These agreements are broadly similar and they generally provide that social insurance paid in Ireland and the other country can be combined to help people qualify for old age and retirement pensions
ga: Tríd is tríd tá na haontais seo cosúil le chéile agus go hiondúil socraíonn siad gur féidir árachas sóisialta a íoctar in Éirinn agus i dtíortha eile, a chur le chéile chun go mbeadh daoine i dteideal pinsin sean-aoise agus pinsin scoir

source: Again, in general, the method of calculation is similar to the EU rules
ga: Go hiondúil bíonn an módh a úsáidtear chun méid an phinsin a oibriú amach, cosúil le rialacha an AE

source: State Pension (Contributory) rates from 10 March 2017
ga: Pinsean Stáit (Ranníocach): Rátaí ón 10 Márta 2017

source: │Yearly average PRSI contributions │Personal rate per week, € │Increase for a qualified adult* (under 66), € │Increase for a qualified adult* (over 66), € │
ga: │Meán Bliantúil │Ráta Pearsanta (seachtainiúil), € │Méadú i Leith Duine Aosaithe Cháilithe faoi 66* (uasráta seachtainiúil) │Méadú i Leith Duine Aosaithe Cháilithe atá 66+* (uasráta seachtainiúil) │

source: │48 or over │238.30 │158.80 │213.50 │
ga: │48 nó níos mó │238.30 │158.80 │213.50 │

source: State Pension (Contributory) rates from 10 March 2017 for people who qualified for pensions before 1 September 2012
ga: *Íocaíocht faoi réir thástáil maoine is ea an Méadú i leith Duine Aosaithe Cháilithe - féach thíos

source: *These qualified adult rates apply to claims made from 6 April 2001
ga: Siad na rátaí le haghaidh Pinsean Stáit (Ranníocach) í 2012:

source: │48 or over │233.30 │155.50 │209.00 │
ga: │48 nó níos mó │€238.30 │€158.80 │€213.50 │

source: This increase is not paid to qualified adults
ga: Sochair bhreise leasa shóisialaigh

source: The Living Alone Increase may be payable to people who live completely alone
ga: D'fhéadfadh Méadú um Chónaí Aonair a bheith íoctha do dhaoine a chónaíonn ina n-aonair

source: You may also be eligible for other benefits. Find out more about medical cards, the Household Benefits Package and Fuel Allowance
ga: D'fhéadfá cáiliú le haghaidh sochair eile, faigh amach tuilleadh faoi chárta leighis, an Pacáiste Sochar Teaghlaigh agus Liúntas Breosla

source: You can get an increase in your payment for an adult dependant (called a qualified adult)
ga: Is féidir leat méadú a fháil i d'íocaíocht i gcomhair duine fásta cháilithe

source: Your income is not taken into account in the assessment for a Increase for a Qualified Adult
ga: Ní thógtar d'ioncam san áireamh ó thaobh measúnú maidir le Méadú do Dhuine Fásta Cáilithe

source: Any income your adult dependant has from employment, self-employment, savings, investments and capital (for example, any property except your own home) is taken into account
ga: Tógfar aon ioncam atá ag do dhuine fásta cháilithe ó fhostaíocht, féinfhostaíocht, coigiltis, infheistíochtaí agus caipiteal (mar shampla, aon mhaoin seachas do theach féin ag an mbaile) san áireamh

source: If you have joint savings or investments with your spouse, civil partner or cohabitant only half is taken into account
ga: Má tá caipiteal nó infheistíochtaí coinnithe i gcomhpháirt idir tú féin agus do chéile, pháirtnéir sibhialta nó chomhchónaitheoir ní thógtar ach amháin leath den luach san áireamh

source: If you are getting a State Pension (Contributory) the Increase for a Qualified Adult is automatically paid directly to your adult dependant
ga: Má tá tú ag fáil Pinsin Stáit (Ranníocach) íocfar an méadú do dhuine fásta go díreach agus go huathoibritheach le do cleithiúnaí lánaoiseach

source: This only applies to applications for State pensions received by the Department on or after 27 September 2007
ga: Ní bhaineann sé seo ach le hiarratais ar phinsin Stáit a fuarthas sa Roinn ar 27 Meán Fómhair 2007 nó ina dhiaidh

source: You can also get an increase in your payment for child dependants (known as qualified children)
ga: Is féidir leat méadú a fháil ar d'íocaíocht i gcomhair do chleithiúnaí linbh freisin

source: Since 6 July 2012 you can no longer claim an Increase for a Qualified Child (IQC) with your State Pension (Contributory) if your spouse, civil partner or cohabitant has an income of over €400 a week
ga: Ón 6 Iúil 2012, má tá ioncam ag do chéile, pháirtnéir sibhialta nó chomhchónaitheoir de bhreis ar €400 sa tseachtain, ní féidir leat Méadú i leith Leanbh Cáilithe (MLC) a éileamh

source: You get a half-rate IQC if your spouse, civil partner or cohabitant earns between €310 and €400 a week
ga: Má thuilleann do chéile, pháirtnéir sibhialta nó chomhchónaitheoir idir €310 agus €400 sa tseachtain, gheobhaidh tú MLC leathráta

source: This only applies to claims made after 6 July 2012
ga: Ní bhaineann seo ach amháin le héilimh déanta i ndiaidh 6 Iúil 2012

source: You can request a copy of your social insurance record through MyWelfare.ie
ga: Féadfaidh tú staire d'árachais shóisialta a sheiceáil i rannóg Thaifid Lárnacha an ÁSPC sa Roinn Coimirce Sóisialaí

source: To do this, you need your PPS (Personal Public Service) Number
ga: Le go bhféadfaidh tú do thaifead árachais shóisialta a sheiceáil, ní mór duit d'Uimhir Phearsanta Seirbhíse Poiblí (PSP) a bheith agat

source: You can get a State Pension (Contributory) form (pdf) from your local post office and your Intreo Centre or Social Welfare Branch Office
ga: Tá na foirmeacha seo le fáil ó d'oifig phoist áitiúil agus óna hoifigí áitiúla de chuid na Roinne Coimirce Sóisialaí

source: You should apply 3 months before the age of 66. However, if you have paid social insurance contributions in more than one country, you should apply 6 months before reaching 66
ga: Ba cheart duit iarratas a dhéanamh 3 mhí roimh aois a 66 duit agus 6 mhí roimh aois a 66 má amhlaidh a rinne tú ranníocaíochtaí árachais shóisialta i mbreis agus tír amháin

source: If you are currently getting a State Pension Contributory and wish to apply for an Increase for a Qualified Adult for your spouse, civil partner or cohabitant you should fill out form SPCQA1(pdf)
ga: Má fhaigheann tú Pinsean Stáit (Ranníocach) láithreach agus más mian leat iarratas ar Mhéadú Dhuine Fásta Cáilithe le haghaidh do chéile, do pháirtnéir sibhialta nó do chomhchónaitheoir a dhéanamh, caithfidh tú foirm SPCQA1 (pdf) a chomhlánú

source: Note that any increase for a qualified adult that you may qualify for will be paid directly to your spouse, civil partner or cohabitant unless they state that they wish to have it paid to you
ga: Tabhair faoi deara má tá tú incháilithe le haghaidh aon mhéadú duine fásta cáilithe, íocfar é díreach le do chéile, do pháirtnéir sibhialta nó do chomhchónaitheoir mura ndéarfaidís ba mhaith leo go n-íocfar leat

source: You may qualify for Supplementary Welfare Allowance if there is a delay in processing your claim
ga: B'fhéidir go mbeidh teideal agat ar Liúntas Leasa Forlíontach le linn do d'iarratas a bheith á phróiseáil ag an Roinn

source: From April 2012 late claims for contributory pensions can be backdated for a maximum of 6 months
ga: Ó Aibreán 2012 is féidir éilimh déanacha ar phinsin ranníocacha bheith siardhátaithe suas go 6 mhí ar a mhéid

source: This applies to State Pension (Contributory and Transition) and Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: Baineann sé seo le Pinsean Stáit (Ranníocach agus Eatramhach) agus Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: Read more in our document about late claims
ga: Léigh tuilleadh inár ndoiciméad faoi éileamh déanacha

source: Questions about your eligibility for a State Pension (Contributory) should be addressed to your Intreo Centre or Social Welfare Branch Office or:
ga: Ba cheart aon cheist a bhaineann le do theideal ar Phinsean Stáit (Ranníocach) a chur chuig d'Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh nó chuig:

source: Department of Social Protection
ga: An Roinn Coimirce Sóisialaí

source: Opening Hours:This office does not offer a service to personal callers
ga: Uaireanta Oscailte:Ní thairgeann an oifig seo seirbhís do chuairteoirí pearsanta

source: All queries must be made using the online enquiry form, by telephone or in writing
ga: Caithfidh gach ceist a bheith cur isteach tríd an fhoirm fiosraithe ar líne a úsáid, tríd an teileafón nó i scríbhinn

source: You can email the State Pension (Contributory) section using the secure enquiry form
ga: Is féidir leat ríomhphost don Rannóg Pinsean Stáit (Ranníocach) a sheoladh tríd an fhoirm fhiosraithe daingnithe Pinsean Stáit (Ranníocach) a úsáid

source: If you wish to talk to someone face-to-face about your pension entitlements, you can visit your local Citizens Information Centre, Social Welfare Branch Office or Intreo Centre
ga: Más mian leat labhairt duine-le-duine faoi do theidlíochtaí, is féidir leat cuairt a thabhairt ar d'Ionad Faisnéise do Shaoránaigh áitiúil, d'Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh

source: When you have received a copy of your PRSI contribution record through MyWelfare.ie, any queries you have regarding your record should be addressed to:
ga: Ba cheart ceisteanna a bhaineann le do thaifead árachais shóisialta a chur chuig:

source: Changes to the State Pension (Contributory)
ga: Athruithe ar an bPinsean Stáit (Ranníocach)

source: The Social Welfare and Pensions Act 2011 made a number of changes to the qualifying age for State pensions
ga: Rinne an tAcht Leasa Shóisialaigh agus Pinsean 2011 roinnt athruithe ar an aois cháilitheach do na pinsin Stáit

source: The qualifying age will rise to 67 in 2021 and 68 in 2028. So:
ga: Beidh an aois cháilitheach ardaithe go dtí 67 bliain i 2021 agus 68 bliain i 2028 mar a leanas:

source: • If you were born on or after 1 January 1955 the minimum qualifying State pension age will be 67
ga: • Má saolaíodh tú an 1 Eanáir 1955 nó ina dhiaidh ní cháileoidh tú don Pinsean Stáit go dtí go mbeidh tú 67 bliain ar a laghad

source: • If you were born on or after 1 January 1961 the minimum qualifying State pension age will be 68
ga: • Má saolaíodh tú an 1 Eanáir 1961 nó ina dhiaidh ní cháileoidh tú don Pinsean Stáit go dtí go mbeidh tú 68 bliain ar a laghad

source: Under the National Pensions Framework a number of other changes were proposed to the qualifying conditions for the State Pension (Contributory). This is a summary of the proposals
ga: Faoin gCreatlach Náisiúnta um Pinsin tá roinnt athruithe eile pleanáilte do na choinníollacha cáilitheacha don Phinsean Stáit (Ranníocach) (ó 2020)

source: Note that legislation is required before these changes come into effect and that, at present, these remain proposals
ga: Teastaíonn reachtaíocht sula dtagann na hathruithe seo i bhfeidhm

source: The main change proposed was the introduction of a total contributions approach to replace the current yearly averaging system
ga: Is é an príomhathrú atá molta ná tabhairt isteach cur chuige ranníocaíochtaí iomláin chun teacht in áit an chórais atá ann faoi láthair

source: This means that the amount of pension paid to you would be directly proportionate to the number of social insurance contributions and/or credits you have made over your working life
ga: Ciallaíonn sé seo go mbeidh méid an phinsin a íocfar leat díreach ar aon dul le líon na ranníocaíochtaí árachais shóisialaigh agus/nó creidmheasanna a d'fhéadfadh a bheith íoctha agat thar do shaol oibre

source: So if you were born after 1 January 1954, when you reach pension age, you would need a total of 30 years contributions and/or credits to get the maximum State Pension
ga: Más rud é gur rugadh thú tar éis 1 Eanáir 1954, nuair a bhaineann tú aois an phinsin amach, teastóidh 30 bliain de ranníocaíochtaí agus/nó creidmheasanna chun an Pinsean Stáit is mó a fháil

source: You would be able to get the minimum State Pension if you have paid 520 full-rate contributions (10 years)
ga: Beidh tú in ann an Pinsean Stáit is lú a fháil má tá 520 ranníocaíocht ag an ráta iomláin íoctha agat (10 mbliana)

source: The minimum pension would be one third of the maximum rate
ga: Beidh an pinsean is lú ag aon trian den ráta uasta

source: You could then get a further 1/30th of the pension for each additional year of contributions that you have
ga: Is féidir leat aon tríocha eile den phinsean a fháil do gach bliain bhreise ar ranníocaíochtaí atá agat

source: The maximum number of credits that could be used in calculating your entitlement to State Pension would be 520 (or 10 years)
ga: Is é an líon uasta de chreidmheasanna gur féidir leat a úsáid agus do theidlíocht Pinsin Stáit á ríomh ná 520 (nó 10 mbliana)

source: Pro-rata pension for self-employed people
ga: Pinsean pro-rata do dhaoine féin-fhostaithe

source: The self-employed have been obliged to pay social insurance since 1988
ga: Tá dualgas ar dhuine féin-fhostaithe árachas sóisialta a íoc ó 1988 i leith

source: Prior to that, some self-employed people were voluntarily paying insurance
ga: Roimhe sin bhíodh roinnt daoine féin-fhostaithe ag íoc árachais go deonach

source: Some self-employed people were already over the minimum age when they first started to pay contributions in 1988
ga: Bhí roinnt daoine féin-fhostaithe os cionn an íos-aois cheana féin nuair a thosaigh siad ag íoc árachais i 1988

source: In April 1999, a special pro-rata pension was introduced for them
ga: Í mí Aibreáin 1999 tugadh isteach pinsean speisialta dá-réir, don dream seo

source: Only people aged 56 or over on 6 April 1988 (born on or before 6 April 1932) qualify for this pension
ga: D'fhéadfá a bheith i dteideal an phinsin dá-réir má bhí tú 56 nó ós a cionn ar an 6ú Aibreán 1988 (gur rugadh thú ar nó roimh 6ú Aibreán 1932)

source: Pro-rata pensions for people with pre-1953 contributions
ga: Pinsean pro-rata do dhaoine a d'íoc ranníocaíochtaí roimh 1953

source: This pro-rata pension was introduced in May 2000
ga: Tugadh an pinsean seo isteach den chéad uair i mí Bealtaine 2000

source: You may qualify if you have at least 520 full contributions, some of which must have been paid before 1953
ga: D'fhéadfá a bheith ina theideal má tá 260 ranníocaíochtaí ar a laghad agat ag an lán-ráta agus cuid acu a bheith íoctha roimh 1953

source: Every 2 contributions paid before 1953 count as 3
ga: Déantar gach 2 ranníocaíochtaí a bhí íoctha roimh 1953 a áireamh mar 3 ranníocaíochtaí

source: If you meet these conditions, you may get a pro-rata pension of half the normal maximum rate
ga: Má chomhlíonann tú na riachtanais sin d'fhéadfá pinsean dá-réir ag leath ráta a fháil

source: The increases for a qualified adult and child are also at payable at half-rate
ga: Íoctar an liúntas le haghaidh páiste cleithiúnaigh ag leath an ráta freisin

source: The increase for pensioners over 80 years of age is paid in full
ga: Íoctar an liúntas le haghaidh duine os cionn 80 ag an ráta iomlán

source: This pension no longer applies to new applicants from January 2013
ga: Ní bhaineann an pinsean seo le hiarratasóirí nua ó Eanáir 2013

source: The first group for whom pro-rata pensions were arranged were those who had been in and out of insurance because of the operation of the income limit on contributions
ga: Socraíodh pinsin pro-rata ar dtús dóibh siúd a raibh árachas acu tráth amháin agus tada acu uair eile de thoradh na dteorainneacha ioncaim a cuireadh ar ranníocaíochtaí

source: Prior to 1974, non-manual workers were obliged to pay social insurance contributions only if their income was below a certain level
ga: Roimh 1974 ní raibh sé de dhualgas ar oibrithe nach raibh obair láimhe ar siúl acu ranníocaíochtaí árachas sóisialta a dhéanamh ach amháin má bhí a n-ioncam faoi bhun leibhéal áirithe

source: From 1 April 1974, there has been no income limit
ga: Cuireadh deireadh leis an teorainn ioncaim seo in Aibreán 1974

source: Many people paid social insurance for a period and then ceased to pay when their income went above the limit then came back into the insurance system in April 1974 because of the abolition of the income limit
ga: D'íoc a lán daoine as árachas sóisialta ar feadh tamaill, d'éirigh as ansin ó thaobh ioncaim os cionn teorainn agus d'fhill ar an gcóras in Aibreán 1974 toisc gur cuireadh an teorainn ioncaim ar ceal

source: They would not meet the usual average requirement because they ceased to pay for a while
ga: Ní raibh siad ábalta an meánriachtanas a shásamh mar d'éirigh siad as íoc ar feadh tamaill

source: On 14 October 1988, arrangements were made for them to qualify for a pro-rata pension
ga: Rinneadh socruithe an 14 Meán Fómhair 1988 chun go mbeadh siad incháilithe pinsin pro-rata a fháil

source: Their average is measured in the usual way and if that average is 10 or more they get a pension in the normal way
ga: Déantar an mheánuimhir a mheas ar an ngnáthbhealach agus má tá 10 nó breis acu ar an meán faigheann siad pinsean ar an ngnáthbhealach

source: However, if it is between 5 and 9 they may get a special partial pension which is one quarter of the maximum pension
ga: B'fhéidir go bhfaighidh siad pinsean pro-rata, (ceathrú den uasphinsean), áfach, má tá sí idir 5 agus 9

source: This pro-rata pension is payable to people who meet the quite specific conditions outlined
ga: Is féidir an pinsean pro-rata, seo a íoc le daoine a chomhlíonann na coinníollacha speisialta seo a leanas

source: That is, you must have a broken insurance record and have re-entered insurance in 1974 because of the removal of the income limit
ga: Is féidir an pinsean pro-rata, seo a íoc le daoine a bhfuil bearnaí ina gcuid árachais acu agus a tháinig isteach in árachas arís sa mbliain 1974 nuair a cuireadh deireadh leis an teorann ioncaim

source: If you re-entered insurance in that year for any other reason (for example, because you had previously been self-employed or out of the country), you do not meet these specific terms and you would not be eligible for this pro-rata pension
ga: Má tháinig tú isteach in árachas arís sa bhliain sin ar aon chúis eile (mar shampla, mar gheall ar go raibh tú féin-fhostaithe roimhe sin nó amuigh as an tír), ní chomhlíonann tú na riachtanais agus ní bheidh tú i dteideal pinsean pro-rata

source: If you qualify for this pro-rata pension you may also get the appropriate Increase for Qualified Adult for a dependent spouse, civil partner or cohabitant and an Increase for a Qualified Child
ga: Má tá tú incháilithe an pinsean pro-rata seo a fháil féadfaidh tú liúntas cáilithe an duine fásta a fháil agus liúntas iomlán do leanaí cleithiúnacha

source: This pro-rata pension is for State Pension (Contributory) and Widow’s, Widower’s or Surviving Civil Partner's Contributory Pension only
ga: Ní bhaineann an pinsean pro-rata seo ach amháin le Pinsean Stáit (Ranníocach) agus le Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: Because it is easier to qualify for a Widow’s, Widower's or Surviving Civil Partner's Contributory Pension the numbers who need the pro-rata pensions are very small
ga: Tá sé níos éasca cáiliú le haghaidh Pinsin Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) agus dá bhrí sin tá méid an-bheag de dhaoine atá pinsin pro-rata ag teastáil uathu
